# Competitive Landscape - mySQL Database creation

First: information regarding school, comments and reviews from students

In [1]:
# dictionary with the schools evaluated in this project

schools = {   
'ironhack' : 10828,
'app-academy' : 10525,
'springboard' : 11035,
'le-wagon' : 10868,
}

# importing libraries
import re
import pandas as pd
from pandas.io.json import json_normalize
import requests

# function to get the comments information
def get_comments_school(school):
    TAG_RE = re.compile(r'<[^>]+>')
    # defines url to make api call to data -> dynamic with school if you want to scrape competition
    url = "https://www.switchup.org/chimera/v1/school-review-list?mainTemplate=school-review-list&path=%2Fbootcamps%2F" + school + "&isDataTarget=false&page=3&perPage=10000&simpleHtml=true&truncationLength=250"
    #makes get request and converts answer to json
    # url defines the page of all the information, request is made, and information is returned to data variable
    data = requests.get(url).json()
    #converts json to dataframe
    reviews =  pd.DataFrame(data['content']['reviews'])
  
    #aux function to apply regex and remove tags
    def remove_tags(x):
        return TAG_RE.sub('',x)
    reviews['review_body'] = reviews['body'].apply(remove_tags)
    reviews['school'] = school
    return reviews

In [2]:
# Create a df with all the comments information
comments = []

for school in schools.keys():
    print(school)
    comments.append(get_comments_school(school))

comments = pd.concat(comments)

ironhack
app-academy
springboard
le-wagon

In [3]:
#comments

comments['school_id'] = [schools[x] for x in comments['school']]

comments.rename(columns={'id': 'comment_id'}, inplace=True)

comments

,comment_id,name,anonymous,hostProgramName,graduatingYear,isAlumni,jobTitle,tagline,body,createdAt,...,program,user,overallScore,comments,overall,curriculum,jobSupport,review_body,school,school_id
0,276568,Guilherme golabek brein,False,None,2018.0,False,Senior Associate,Improper billing,"<span class=""truncatable""><p></p><p>A year aft...",4/30/2021,...,Web Development Part-Time,{'image': None},1.0,[],1.0,1.0,1.0,"A year after completing my course, ironhack co...",ironhack,10828
1,276147,Charlotte Urvoy,False,None,2021.0,False,UX UI Designer,Riche et pragmatique,"<span class=""truncatable""><p></p><p>- La métho...",4/20/2021,...,UX/UI Design Bootcamp,{'image': None},5.0,[],5.0,5.0,5.0,- La méthode d'apprentissage est l'une des mei...,ironhack,10828
2,275972,Anonymous,True,None,2021.0,False,,Amazing experience,"<span class=""truncatable""><p></p><p>the UX/UI ...",4/17/2021,...,UX/UI Design Bootcamp,{'image': None},4.0,[],5.0,4.0,3.0,the UX/UI bootcamp has been an amazing learnin...,ironhack,10828
3,275872,Ahmad Khalaf,False,None,2021.0,False,Product Designer,Intense but good experience,"<span class=""truncatable""><p></p><p>When I sta...",4/15/2021,...,UX/UI Design Bootcamp,{'image': None},4.0,[],4.0,4.0,4.0,When I started I was a little disappointed but...,ironhack,10828
4,275855,Morgane Favchtein,False,None,2021.0,False,UX UI Designer,Very nice experience !,"<span class=""truncatable""><p></p><p>The UX UI ...",4/14/2021,...,UX/UI Design Bootcamp,{'image': None},4.3,[],5.0,4.0,4.0,The UX UI Design bootcamp is a great way to tr...,ironhack,10828
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1961,231857,Baptiste H.,False,None,2014.0,True,Software Engineer,"I entered ""le Wagon"" program et I and found a ...","<span class=""truncatable""><p>I entered ""le Wag...",10/17/2014,...,None,{'image': None},5.0,[],5.0,5.0,5.0,"I entered ""le Wagon"" with my partner and we bo...",le-wagon,10868
1962,231855,Mélanie Navarro,False,None,NaN,False,None,9 very intensive weeks and I recommend it to a...,"<span class=""truncatable""><p>The training exce...",10/16/2014,...,None,{'image': None},5.0,[],5.0,5.0,5.0,The training exceeded my expectations:- Master...,le-wagon,10868
1963,231853,Olivier Xu,False,None,2014.0,True,Co-founder @ getkudoz.com,Le Wagon,"<span class=""truncatable""><p>I attended the 10...",10/15/2014,...,None,{'image': None},5.0,[],5.0,5.0,5.0,I attended the 10-week bootcamp by Le Wagon in...,le-wagon,10868
1964,231852,Sébastien,False,None,2014.0,True,Junior Developer,From zero to a developer job in 9 weeks.,"<span class=""truncatable""><p>I entered ""le Wag...",10/15/2014,...,None,{'image': None},5.0,[],5.0,5.0,5.0,"I entered ""le Wagon"" program after being gradu...",le-wagon,10868
1965,231851,Niels Mayrargue,False,None,2014.0,True,None,best training ever,"<span class=""truncatable""><p>I strongly recomm...",10/15/2014,...,None,{'image': None},4.7,[],5.0,5.0,4.0,I strongly recommend this bootcamp :-the team ...,le-wagon,10868

In [4]:
#importing more libraries
from pandas.io.json import json_normalize

# function to get the schools information
def get_school_info(school, school_id):
    url = 'https://www.switchup.org/chimera/v1/bootcamp-data?mainTemplate=bootcamp-data%2Fdescription&path=%2Fbootcamps%2F'+ str(school) + '&isDataTarget=false&bootcampId='+ str(school_id) + '&logoTag=logo&truncationLength=250&readMoreOmission=...&readMoreText=Read%20More&readLessText=Read%20Less'

    data = requests.get(url).json()

    data.keys()

    courses = data['content']['courses']
    courses_df = pd.DataFrame(courses, columns= ['courses'])

    locations = data['content']['locations']
    locations_df = json_normalize(locations)

    badges_df = pd.DataFrame(data['content']['meritBadges'])
    
    website = data['content']['webaddr']
    description = data['content']['description']
    logoUrl = data['content']['logoUrl']
    school_df = pd.DataFrame([website,description,logoUrl]).T
    school_df.columns =  ['website','description','LogoUrl']

    locations_df['school'] = school
    courses_df['school'] = school
    badges_df['school'] = school
    school_df['school'] = school
    

    locations_df['school_id'] = school_id
    courses_df['school_id'] = school_id
    badges_df['school_id'] = school_id
    school_df['school_id'] = school_id

    return locations_df, courses_df, badges_df, school_df

locations_list = []
courses_list = []
badges_list = []
schools_list = []

for school, id in schools.items():
    print(school)
    a,b,c,d = get_school_info(school,id)
    
    locations_list.append(a)
    courses_list.append(b)
    badges_list.append(c)
    schools_list.append(d)

ironhack

<ipython-input-4-9297fa760d64>:16: FutureWarning: pandas.io.json.json_normalize is deprecated, use pandas.json_normalize instead
  locations_df = json_normalize(locations)

app-academy
springboard
le-wagon

In [5]:
locations_list

[      id               description  country.id   country.name country.abbrev  \
 0  15901           Berlin, Germany        57.0        Germany             DE
 1  16022       Mexico City, Mexico        29.0         Mexico             MX
 2  16086    Amsterdam, Netherlands        59.0    Netherlands             NL
 3  16088         Sao Paulo, Brazil        42.0         Brazil             BR
 4  16109             Paris, France        38.0         France             FR
 5  16375  Miami, FL, United States         1.0  United States             US
 6  16376             Madrid, Spain        12.0          Spain             ES
 7  16377          Barcelona, Spain        12.0          Spain             ES
 8  16709          Lisbon, Portugal        28.0       Portugal             PT
 9  17233                    Online         NaN            NaN            NaN

    city.id    city.name city.keyword  state.id state.name state.abbrev  \
 0  31156.0       Berlin       berlin       NaN        NaN          NaN
 1  31175.0  Mexico City  mexico-city       NaN        NaN          NaN
 2  31168.0    Amsterdam    amsterdam       NaN        NaN          NaN
 3  31121.0    Sao Paulo    sao-paulo       NaN        NaN          NaN
 4  31136.0        Paris        paris       NaN        NaN          NaN
 5     31.0        Miami        miami      11.0    Florida           FL
 6  31052.0       Madrid       madrid       NaN        NaN          NaN
 7  31170.0    Barcelona    barcelona       NaN        NaN          NaN
 8  31075.0       Lisbon       lisbon       NaN        NaN          NaN
 9      NaN          NaN          NaN       1.0     Online       Online

   state.keyword    school  school_id
 0           NaN  ironhack      10828
 1           NaN  ironhack      10828
 2           NaN  ironhack      10828
 3           NaN  ironhack      10828
 4           NaN  ironhack      10828
 5       florida  ironhack      10828
 6           NaN  ironhack      10828
 7           NaN  ironhack      10828
 8           NaN  ironhack      10828
 9        online  ironhack      10828  ,
       id                       description  country.id   country.name  \
 0  15704  San Francisco, CA, United States         1.0  United States
 1  15705  New York City, NY, United States         1.0  United States
 2  15862                            Online         NaN            NaN

   country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0             US         6  California           CA    california     13.0
 1             US        34    New York           NY      new-york   1507.0
 2            NaN         1      Online       Online        online      NaN

        city.name   city.keyword       school  school_id
 0  San Francisco  san-francisco  app-academy      10525
 1            NYC  new-york-city  app-academy      10525
 2            NaN            NaN  app-academy      10525  ,
       id description  state.id state.name state.abbrev state.keyword  \
 0  16013      Online         1     Online       Online        online

         school  school_id
 0  springboard      11035  ,
        id                  description  country.id          country.name  \
 0   15803         Melbourne, Australia          20             Australia
 1   15904          Casablanca, Morocco          44               Morocco
 2   15906      Buenos Aires, Argentina          60             Argentina
 3   15964            Brussels, Belgium          46               Belgium
 4   15979                 Milan, Italy          39                 Italy
 5   15996               Chengdu, China          15                 China
 6   16039          Mexico City, Mexico          29                Mexico
 7   16049       Amsterdam, Netherlands          59           Netherlands
 8   16106            Sao Paulo, Brazil          42                Brazil
 9   16124             Barcelona, Spain          12                 Spain
 10  16145             Bordeaux, France          38                France
 11  16146          Copenhagen, Denmark          47               Denmark
 12  16147                Lille, France          38                France
 13  16148             Lisbon, Portugal          28              Portugal
 14  16149              Bali, Indonesia          35             Indonesia
 15  16150               Nantes, France          38                France
 16  16274      Rio de Janeiro , Brazil          42                Brazil
 17  16275            Marseille, France          38                France
 18  16282             Montreal, Canada           2                Canada
 19  16283              Shanghai, China          15                 China
 20  16307       Belo Horizonte, Brazil          42                Brazil
 21  16407                 Tokyo, Japan          48                 Japan
 22  16408                 Lyon, France          38                France
 23  16478             Tel Aviv, Israel           5                Israel
 24  16570                 Kyoto, Japan          48                 Japan
 25  16765              Berlin, Germany          57               Germany
 26  16767                Paris, France          38                France
 27  16775              Shenzhen, China          15                 China
 28  16776        Lausanne, Switzerland          32           Switzerland
 29  16800                Madrid, Spain          12                 Spain
 30  16804                 Oslo, Norway          52                Norway
 31  16805               Rennes, France          38                France
 32  16936         Singapore, Singapore          56             Singapore
 33  16967              London, England          61               England
 34  16968                  Rome, Italy          39                 Italy
 35  17128            Stockholm, Sweden          37                Sweden
 36  17129                 Seoul, Korea          55           South Korea
 37  17157             Istanbul, Turkey         237                Turkey
 38  17188              Toronto, Canada           2                Canada
 39  17314  Dubai, United Arab Emirates          34  United Arab Emirates
 40  17395              Munich, Germany          57               Germany
 41  17476              Santiago, Chile          22                 Chile
 42  17732       Saint Pierre, Mauritus         171             Mauritius
 43  17765                 Nice, France          38                France
 44  17772             Cologne, Germany          57               Germany

    country.abbrev  city.id        city.name    city.keyword    school  \
 0              AU    31174        Melbourne       melbourne  le-wagon
 1              MA    31119       Casablanca      casablanca  le-wagon
 2              AR    31171     Buenos Aires    buenos-aires  le-wagon
 3              BE    31125         Brussels        brussels  le-wagon
 4              IT    31107            Milan           milan  le-wagon
 5              CN    31126          Chengdu         chengdu  le-wagon
 6              MX    31175      Mexico City     mexico-city  le-wagon
 7              NL    31168        Amsterdam       amsterdam  le-wagon
 8              BR    31121        Sao Paulo       sao-paulo  le-wagon
 9              ES    31170        Barcelona       barcelona  le-wagon
 10             FR    31124         Bordeaux        bordeaux  le-wagon
 11             DK    31127       Copenhagen      copenhagen  le-wagon
 12             FR    31128            Lille           lille  le-wagon
 13             PT    31075           Lisbon          lisbon  le-wagon
 14             ID    31169             Bali            bali  le-wagon
 15             FR    31130           Nantes          nantes  le-wagon
 16             BR    31131  Rio de Janeiro   rio-de-janeiro  le-wagon
 17             FR    31129        Marseille       marseille  le-wagon
 18             CA    31135         Montreal        montreal  le-wagon
 19             CN    31108         Shanghai        shanghai  le-wagon
 20             BR    31123   Belo Horizonte  belo-horizonte  le-wagon
 21             JP    31132            Tokyo           tokyo  le-wagon
 22             FR    31106             Lyon            lyon  le-wagon
 23             IL    31079         Tel Aviv        tel-aviv  le-wagon
 24             JP    31134            Kyoto           kyoto  le-wagon
 25             DE    31156           Berlin          berlin  le-wagon
 26             FR    31136            Paris           paris  le-wagon
 27             CN    31164         Shenzhen        shenzhen  le-wagon
 28             CH    31163         Lausanne        lausanne  le-wagon
 29             ES    31052           Madrid          madrid  le-wagon
 30             NO    31145             Oslo            oslo  le-wagon
 31             FR    31147           Rennes          rennes  le-wagon
 32             SG    31154        Singapore       singapore  le-wagon
 33             GB    31176           London          london  le-wagon
 34             IT    31180             Rome            rome  le-wagon
 35             SE    31109        Stockholm       stockholm  le-wagon
 36             KR    31151            Seoul            seol  le-wagon
 37             TR    31193         Istanbul        istanbul  le-wagon
 38             CA    31152          Toronto         toronto  le-wagon
 39             AE    31093            Dubai           dubai  le-wagon
 40             DE    31158           Munich          munich  le-wagon
 41             CL    31067         Santiago        santiago  le-wagon
 42             MU    31246     Saint Pierre    saint-pierre  le-wagon
 43             FR    31239             Nice            nice  le-wagon
 44             DE    31254          Cologne         cologne  le-wagon

     school_id
 0       10868
 1       10868
 2       10868
 3       10868
 4       10868
 5       10868
 6       10868
 7       10868
 8       10868
 9       10868
 10      10868
 11      10868
 12      10868
 13      10868
 14      10868
 15      10868
 16      10868
 17      10868
 18      10868
 19      10868
 20      10868
 21      10868
 22      10868
 23      10868
 24      10868
 25      10868
 26      10868
 27      10868
 28      10868
 29      10868
 30      10868
 31      10868
 32      10868
 33      10868
 34      10868
 35      10868
 36      10868
 37      10868
 38      10868
 39      10868
 40      10868
 41      10868
 42      10868
 43      10868
 44      10868  ]

In [6]:
locations = pd.concat(locations_list)
locations.rename(columns={'id': 'location_id','country.id': 'country_id','country.name':'country_name',
                          'country.abbrev':'country_abbrev','city.id':'city_id','city.name':'city_name',
                          'city.keyword':'city_keyword','state.id':'state_id','state.name':'state_name',
                          'state.abbrev':'state_abbrev','state.keyword':'state_keyword'}, inplace=True)
locations

,location_id,description,country_id,country_name,country_abbrev,city_id,city_name,city_keyword,state_id,state_name,state_abbrev,state_keyword,school,school_id
0,15901,"Berlin, Germany",57.0,Germany,DE,31156.0,Berlin,berlin,NaN,NaN,NaN,NaN,ironhack,10828
1,16022,"Mexico City, Mexico",29.0,Mexico,MX,31175.0,Mexico City,mexico-city,NaN,NaN,NaN,NaN,ironhack,10828
2,16086,"Amsterdam, Netherlands",59.0,Netherlands,NL,31168.0,Amsterdam,amsterdam,NaN,NaN,NaN,NaN,ironhack,10828
3,16088,"Sao Paulo, Brazil",42.0,Brazil,BR,31121.0,Sao Paulo,sao-paulo,NaN,NaN,NaN,NaN,ironhack,10828
4,16109,"Paris, France",38.0,France,FR,31136.0,Paris,paris,NaN,NaN,NaN,NaN,ironhack,10828
5,16375,"Miami, FL, United States",1.0,United States,US,31.0,Miami,miami,11.0,Florida,FL,florida,ironhack,10828
6,16376,"Madrid, Spain",12.0,Spain,ES,31052.0,Madrid,madrid,NaN,NaN,NaN,NaN,ironhack,10828
7,16377,"Barcelona, Spain",12.0,Spain,ES,31170.0,Barcelona,barcelona,NaN,NaN,NaN,NaN,ironhack,10828
8,16709,"Lisbon, Portugal",28.0,Portugal,PT,31075.0,Lisbon,lisbon,NaN,NaN,NaN,NaN,ironhack,10828
9,17233,Online,NaN,NaN,NaN,NaN,NaN,NaN,1.0,Online,Online,online,ironhack,10828
0,15704,"San Francisco, CA, United States",1.0,United States,US,13.0,San Francisco,san-francisco,6.0,California,CA,california,app-academy,10525
1,15705,"New York City, NY, United States",1.0,United States,US,1507.0,NYC,new-york-city,34.0,New York,NY,new-york,app-academy,10525
2,15862,Online,NaN,NaN,NaN,NaN,NaN,NaN,1.0,Online,Online,online,app-academy,10525
0,16013,Online,NaN,NaN,NaN,NaN,NaN,NaN,1.0,Online,Online,online,springboard,11035
0,15803,"Melbourne, Australia",20.0,Australia,AU,31174.0,Melbourne,melbourne,NaN,NaN,NaN,NaN,le-wagon,10868
1,15904,"Casablanca, Morocco",44.0,Morocco,MA,31119.0,Casablanca,casablanca,NaN,NaN,NaN,NaN,le-wagon,10868
2,15906,"Buenos Aires, Argentina",60.0,Argentina,AR,31171.0,Buenos Aires,buenos-aires,NaN,NaN,NaN,NaN,le-wagon,10868
3,15964,"Brussels, Belgium",46.0,Belgium,BE,31125.0,Brussels,brussels,NaN,NaN,NaN,NaN,le-wagon,10868
4,15979,"Milan, Italy",39.0,Italy,IT,31107.0,Milan,milan,NaN,NaN,NaN,NaN,le-wagon,10868
5,15996,"Chengdu, China",15.0,China,CN,31126.0,Chengdu,chengdu,NaN,NaN,NaN,NaN,le-wagon,10868
6,16039,"Mexico City, Mexico",29.0,Mexico,MX,31175.0,Mexico City,mexico-city,NaN,NaN,NaN,NaN,le-wagon,10868
7,16049,"Amsterdam, Netherlands",59.0,Netherlands,NL,31168.0,Amsterdam,amsterdam,NaN,NaN,NaN,NaN,le-wagon,10868
8,16106,"Sao Paulo, Brazil",42.0,Brazil,BR,31121.0,Sao Paulo,sao-paulo,NaN,NaN,NaN,NaN,le-wagon,10868
9,16124,"Barcelona, Spain",12.0,Spain,ES,31170.0,Barcelona,barcelona,NaN,NaN,NaN,NaN,le-wagon,10868
10,16145,"Bordeaux, France",38.0,France,FR,31124.0,Bordeaux,bordeaux,NaN,NaN,NaN,NaN,le-wagon,10868
11,16146,"Copenhagen, Denmark",47.0,Denmark,DK,31127.0,Copenhagen,copenhagen,NaN,NaN,NaN,NaN,le-wagon,10868
12,16147,"Lille, France",38.0,France,FR,31128.0,Lille,lille,NaN,NaN,NaN,NaN,le-wagon,10868
13,16148,"Lisbon, Portugal",28.0,Portugal,PT,31075.0,Lisbon,lisbon,NaN,NaN,NaN,NaN,le-wagon,10868
14,16149,"Bali, Indonesia",35.0,Indonesia,ID,31169.0,Bali,bali,NaN,NaN,NaN,NaN,le-wagon,10868
15,16150,"Nantes, France",38.0,France,FR,31130.0,Nantes,nantes,NaN,NaN,NaN,NaN,le-wagon,10868
16,16274,"Rio de Janeiro , Brazil",42.0,Brazil,BR,31131.0,Rio de Janeiro,rio-de-janeiro,NaN,NaN,NaN,NaN,le-wagon,10868
17,16275,"Marseille, France",38.0,France,FR,31129.0,Marseille,marseille,NaN,NaN,NaN,NaN,le-wagon,10868
18,16282,"Montreal, Canada",2.0,Canada,CA,31135.0,Montreal,montreal,NaN,NaN,NaN,NaN,le-wagon,10868
19,16283,"Shanghai, China",15.0,China,CN,31108.0,Shanghai,shanghai,NaN,NaN,NaN,NaN,le-wagon,10868
20,16307,"Belo Horizonte, Brazil",42.0,Brazil,BR,31123.0,Belo Horizonte,belo-horizonte,NaN,NaN,NaN,NaN,le-wagon,10868
21,16407,"Tokyo, Japan",48.0,Japan,JP,31132.0,Tokyo,tokyo,NaN,NaN,NaN,NaN,le-wagon,10868
22,16408,"Lyon, France",38.0,France,FR,31106.0,Lyon,lyon,NaN,NaN,NaN,NaN,le-wagon,10868
23,16478,"Tel Aviv, Israel",5.0,Israel,IL,31079.0,Tel Aviv,tel-aviv,NaN,NaN,NaN,NaN,le-wagon,10868
24,16570,"Kyoto, Japan",48.0,Japan,JP,31134.0,Kyoto,kyoto,NaN,NaN,NaN,NaN,le-wagon,10868
25,16765,"Berlin, Germany",57.0,Germany,DE,31156.0,Berlin,berlin,NaN,NaN,NaN,NaN,le-wagon,10868
26,16767,"Paris, France",38.0,France,FR,31136.0,Paris,paris,NaN,NaN,NaN,NaN,le-wagon,10868
27,16775,"Shenzhen, China",15.0,China,CN,31164.0,Shenzhen,shenzhen,NaN,NaN,NaN,NaN,le-wagon,10868
28,16776,"Lausanne, Switzerland",32.0,Switzerland,CH,31163.0,Lausanne,lausanne,NaN,NaN,NaN,NaN,le-wagon,10868
29,16800,"Madrid, Spain",12.0,Spain,ES,31052.0,Madrid,madrid,NaN,NaN,NaN,NaN,le-wagon,10868
30,16804,"Oslo, Norway",52.0,Norway,NO,31145.0,Oslo,oslo,NaN,NaN,NaN,NaN,le-wagon,10868
31,16805,"Rennes, France",38.0,France,FR,31147.0,Rennes,rennes,NaN,NaN,NaN,NaN,le-wagon,10868
32,16936,"Singapore, Singapore",56.0,Singapore,SG,31154.0,Singapore,singapore,NaN,NaN,NaN,NaN,le-wagon,10868
33,16967,"London, England",61.0,England,GB,31176.0,London,london,NaN,NaN,NaN,NaN,le-wagon,10868
34,16968,"Rome, Italy",39.0,Italy,IT,31180.0,Rome,rome,NaN,NaN,NaN,NaN,le-wagon,10868
35,17128,"Stockholm, Sweden",37.0,Sweden,SE,31109.0,Stockholm,stockholm,NaN,NaN,NaN,NaN,le-wagon,10868
36,17129,"Seoul, Korea",55.0,South Korea,KR,31151.0,Seoul,seol,NaN,NaN,NaN,NaN,le-wagon,10868
37,17157,"Istanbul, Turkey",237.0,Turkey,TR,31193.0,Istanbul,istanbul,NaN,NaN,NaN,NaN,le-wagon,10868
38,17188,"Toronto, Canada",2.0,Canada,CA,31152.0,Toronto,toronto,NaN,NaN,NaN,NaN,le-wagon,10868
39,17314,"Dubai, United Arab Emirates",34.0,United Arab Emirates,AE,31093.0,Dubai,dubai,NaN,NaN,NaN,NaN,le-wagon,10868
40,17395,"Munich, Germany",57.0,Germany,DE,31158.0,Munich,munich,NaN,NaN,NaN,NaN,le-wagon,10868
41,17476,"Santiago, Chile",22.0,Chile,CL,31067.0,Santiago,santiago,NaN,NaN,NaN,NaN,le-wagon,10868
42,17732,"Saint Pierre, Mauritus",171.0,Mauritius,MU,31246.0,Saint Pierre,saint-pierre,NaN,NaN,NaN,NaN,le-wagon,10868
43,17765,"Nice, France",38.0,France,FR,31239.0,Nice,nice,NaN,NaN,NaN,NaN,le-wagon,10868
44,17772,"Cologne, Germany",57.0,Germany,DE,31254.0,Cologne,cologne,NaN,NaN,NaN,NaN,le-wagon,10868

In [7]:
courses = pd.concat(courses_list)
courses['courses_id'] = range(1, len(courses) + 1)
courses

,courses,school,school_id,courses_id
0,Cyber Security Bootcamp,ironhack,10828,1
1,Data Analytics Bootcamp,ironhack,10828,2
2,Data Analytics Part-Time,ironhack,10828,3
3,UX/UI Design Bootcamp,ironhack,10828,4
4,UX/UI Design Part-Time,ironhack,10828,5
5,Web Development Bootcamp,ironhack,10828,6
6,Web Development Part-Time,ironhack,10828,7
0,Bootcamp Prep,app-academy,10525,8
1,Software Engineer Track: In-Person,app-academy,10525,9
2,App Academy Open,app-academy,10525,10
3,Software Engineer Track: Online,app-academy,10525,11
0,Cyber Security Career Track,springboard,11035,12
1,Data Analytics Career Track,springboard,11035,13
2,Data Engineering Career Track,springboard,11035,14
3,Data Science Career Track,springboard,11035,15
4,Data Science Career Track Prep,springboard,11035,16
5,Introduction to Design,springboard,11035,17
6,Machine Learning Engineering Career Track,springboard,11035,18
7,Software Engineering Career Track,springboard,11035,19
8,Software Engineering Career Track Prep Course,springboard,11035,20
9,UI/UX Design Career Track,springboard,11035,21
10,UX Career Track,springboard,11035,22
0,Data Science - Full-Time,le-wagon,10868,23
1,Data Science - Part-Time,le-wagon,10868,24
2,Web Development Course - Full-Time,le-wagon,10868,25
3,Web Development Course - Part-Time,le-wagon,10868,26

In [8]:
badges = pd.concat(badges_list)
badges['schoolbadges_id'] = range(1, len(badges) + 1)
badges

,name,keyword,description,school,school_id,schoolbadges_id
0,Available Online,available_online,<p>School offers fully online courses</p>,ironhack,10828,1
1,Verified Outcomes,verified_outcomes,<p>School publishes a third-party verified out...,ironhack,10828,2
2,Flexible Classes,flexible_classes,<p>School offers part-time and evening classes...,ironhack,10828,3
0,Available Online,available_online,<p>School offers fully online courses</p>,app-academy,10525,4
1,Flexible Classes,flexible_classes,<p>School offers part-time and evening classes...,app-academy,10525,5
2,Job Guarantee,job_guarantee,<p>School guarantees job placement</p>,app-academy,10525,6
0,Available Online,available_online,<p>School offers fully online courses</p>,springboard,11035,7
1,Flexible Classes,flexible_classes,<p>School offers part-time and evening classes...,springboard,11035,8
2,Job Guarantee,job_guarantee,<p>School guarantees job placement</p>,springboard,11035,9
0,Available Online,available_online,<p>School offers fully online courses</p>,le-wagon,10868,10
1,Flexible Classes,flexible_classes,<p>School offers part-time and evening classes...,le-wagon,10868,11

In [9]:
schools = pd.concat(schools_list)
schools.head()

,website,description,LogoUrl,school,school_id
0,www.ironhack.com/en,"<span class=""truncatable""><p>Ironhack is a glo...",https://d92mrp7hetgfk.cloudfront.net/images/si...,ironhack,10828
0,appacademy.io,"<span class=""truncatable""><p>App Academy is a ...",https://d92mrp7hetgfk.cloudfront.net/images/si...,app-academy,10525
0,www.springboard.com/?utm_source=switchup&utm_m...,"<span class=""truncatable""><p>Springboard is an...",https://d92mrp7hetgfk.cloudfront.net/images/si...,springboard,11035
0,www.lewagon.com,"<span class=""truncatable""><p>Le Wagon runs imm...",https://d92mrp7hetgfk.cloudfront.net/images/si...,le-wagon,10868

# Creating our database in mySQL

In [10]:
#establish connection
import mysql.connector

In [ ]:
cnx = mysql.connector.connect(user = "root", password = input('password:'),host="localhost")

In [12]:
cnx.is_connected()

True

In [13]:
cursor = cnx.cursor()
cursor

In [14]:
# Create database
query = ("""CREATE DATABASE competitive_landscape;""")
cursor.execute(query)

In [15]:
from sqlalchemy import create_engine

In [ ]:
#Create a engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=input('password:'),
                               db="competitive_landscape"))

In [17]:
# drop comments because there is a problem in the type of objects that are passed to Mysql
comments = comments.drop('comments', axis = 1)
# the same for the comments
comments = comments.drop('user', axis = 1)

In [18]:
#Create comments table in mysql with all data
comments.to_sql('comments', con = engine, if_exists = 'append', chunksize = 1000)

In [19]:
#Add Primary key in comments table
query = ("""ALTER TABLE competitive_landscape.comments ADD PRIMARY KEY(comment_id);""")
cursor.execute(query)

In [20]:
#Create courses table in mysql with all data
courses.to_sql('courses', con = engine, if_exists = 'append', chunksize = 1000)

In [21]:
#Add Primary key in courses table
query = ("""ALTER TABLE competitive_landscape.courses ADD PRIMARY KEY(courses_id);""")
cursor.execute(query)

In [22]:
#Create locations table in mysql with all data
locations.to_sql('locations', con = engine, if_exists = 'append', chunksize = 1000)

In [23]:
#Add Primary key in locations table
query = ("""ALTER TABLE competitive_landscape.locations ADD PRIMARY KEY(location_id);""")
cursor.execute(query)

In [24]:
#Create badges table in mysql with all data
badges.to_sql('badges', con = engine, if_exists = 'append', chunksize = 1000)

In [25]:
#Add Primary key in badges table
query = ("""ALTER TABLE competitive_landscape.badges ADD PRIMARY KEY(schoolbadges_id);""")
cursor.execute(query)

In [26]:
#Create schools table in mysql with all data
schools.to_sql('schools', con = engine, if_exists = 'append', chunksize = 1000)

In [27]:
#Add Primary key in schools table
query = ("""ALTER TABLE competitive_landscape.schools ADD PRIMARY KEY(school_id);""")
cursor.execute(query)

In [28]:
#CREATE THE FOREIGN KEYS

In [29]:
query = ("""ALTER TABLE competitive_landscape.courses ADD FOREIGN KEY (school_id) REFERENCES competitive_landscape.schools (school_id);""")
cursor.execute(query)

In [30]:
query = ("""ALTER TABLE competitive_landscape.badges ADD FOREIGN KEY (school_id) REFERENCES competitive_landscape.schools (school_id);""")
cursor.execute(query)

In [31]:
query = ("""ALTER TABLE competitive_landscape.locations ADD FOREIGN KEY (school_id) REFERENCES competitive_landscape.schools (school_id);""")
cursor.execute(query)

In [32]:
query = ("""ALTER TABLE competitive_landscape.comments ADD FOREIGN KEY (school_id) REFERENCES competitive_landscape.schools (school_id);""")
cursor.execute(query)

# Creating a additional table with information regarding each country

All the information presented in this table is available in: http://wdi.worldbank.org/tables

In [33]:
country_data = pd.read_csv('country_data.csv')
country_data

,Country Name,Country Code,Series Name,Series Code,Scale (Precision),1990 [YR1990],2000 [YR2000],2010 [YR2010],2018 [YR2018]
0,World,WLD,"Population, total",SP.POP.TOTL,Millions (0.00),5280.11,6114.33,6921.87,7592.03
1,World,WLD,Population growth (annual %),SP.POP.GROW,Unit (0.0),1.70,1.30,1.20,1.10
2,World,WLD,Surface area (sq. km),AG.SRF.TOTL.K2,Thousands (0.0),131634.50,131553.70,131784.80,134542.70
3,World,WLD,Population density (people per sq. km of land ...,EN.POP.DNST,Unit (0.0),41.50,48.00,54.30,58.40
4,World,WLD,Poverty headcount ratio at national poverty li...,SI.POV.NAHC,Unit (0.0),NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
13338,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13339,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13340,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13341,Data from database: WDI Central,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13342,Last Updated: 04/26/2021,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Lets clean the table

In [34]:
# columns without relevant information
country_data = country_data.drop('Country Code', axis = 1)
country_data = country_data.drop('Series Code', axis = 1)
country_data

,Country Name,Series Name,Scale (Precision),1990 [YR1990],2000 [YR2000],2010 [YR2010],2018 [YR2018]
0,World,"Population, total",Millions (0.00),5280.11,6114.33,6921.87,7592.03
1,World,Population growth (annual %),Unit (0.0),1.70,1.30,1.20,1.10
2,World,Surface area (sq. km),Thousands (0.0),131634.50,131553.70,131784.80,134542.70
3,World,Population density (people per sq. km of land ...,Unit (0.0),41.50,48.00,54.30,58.40
4,World,Poverty headcount ratio at national poverty li...,Unit (0.0),NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
13338,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13339,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13340,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13341,Data from database: WDI Central,NaN,NaN,NaN,NaN,NaN,NaN
13342,Last Updated: 04/26/2021,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
#lets keep only rows with information that will be evaluated
condition = country_data[((country_data['Series Name'] != 'Population, total') &
                          (country_data['Series Name'] != 'Population growth (annual %)') & 
                          (country_data['Series Name'] != 'Primary completion rate, total (% of relevant age group)') &
                          (country_data['Series Name'] != 'School enrollment, primary (% gross)') & 
                          (country_data['Series Name'] != 'School enrollment, secondary (% gross)') &
                          (country_data['Series Name'] != 'School enrollment, primary and secondary (gross), gender parity index (GPI)') & 
                          (country_data['Series Name'] != 'Mobile cellular subscriptions (per 100 people)') &
                          (country_data['Series Name'] != 'Individuals using the Internet (% of population)') & 
                          (country_data['Series Name'] != 'High-technology exports (% of manufactured exports)'))]
condition

country_data_final = country_data.drop(condition.index, axis=0) # Step 2

country_data_final

,Country Name,Series Name,Scale (Precision),1990 [YR1990],2000 [YR2000],2010 [YR2010],2018 [YR2018]
0,World,"Population, total",Millions (0.00),5280.11,6114.33,6921.87,7592.03
1,World,Population growth (annual %),Unit (0.0),1.70,1.30,1.20,1.10
19,World,"Primary completion rate, total (% of relevant ...",Unit (0),81.00,82.00,89.00,89.00
20,World,"School enrollment, primary (% gross)",Unit (0.0),99.80,98.80,103.20,101.20
21,World,"School enrollment, secondary (% gross)",Unit (0),51.00,60.00,71.00,76.00
...,...,...,...,...,...,...,...
13302,Zimbabwe,"School enrollment, secondary (% gross)",Unit (0),43.00,45.00,NaN,NaN
13303,Zimbabwe,"School enrollment, primary and secondary (gros...",Unit (0),1.00,1.00,NaN,NaN
13326,Zimbabwe,Mobile cellular subscriptions (per 100 people),Unit (0.0),0.00,2.20,60.60,89.40
13327,Zimbabwe,Individuals using the Internet (% of population),Unit (0.0),0.00,0.40,6.40,27.10
13328,Zimbabwe,High-technology exports (% of manufactured exp...,Unit (0),NaN,NaN,2.00,2.00

In [36]:
#Lets rename de columns (mysql friendly)
country_data_final.rename(columns={'Country Name': 'country_name','Series Name': 'indicator',
                             'Scale (Precision)': 'unit','1990 [YR1990]': 'year_1990',
                             '2000 [YR2000]': 'year_2000','2010 [YR2010]': 'year_2010',
                             '2018 [YR2018]': 'year_2018'}, inplace=True)
country_data_final

,country_name,indicator,unit,year_1990,year_2000,year_2010,year_2018
0,World,"Population, total",Millions (0.00),5280.11,6114.33,6921.87,7592.03
1,World,Population growth (annual %),Unit (0.0),1.70,1.30,1.20,1.10
19,World,"Primary completion rate, total (% of relevant ...",Unit (0),81.00,82.00,89.00,89.00
20,World,"School enrollment, primary (% gross)",Unit (0.0),99.80,98.80,103.20,101.20
21,World,"School enrollment, secondary (% gross)",Unit (0),51.00,60.00,71.00,76.00
...,...,...,...,...,...,...,...
13302,Zimbabwe,"School enrollment, secondary (% gross)",Unit (0),43.00,45.00,NaN,NaN
13303,Zimbabwe,"School enrollment, primary and secondary (gros...",Unit (0),1.00,1.00,NaN,NaN
13326,Zimbabwe,Mobile cellular subscriptions (per 100 people),Unit (0.0),0.00,2.20,60.60,89.40
13327,Zimbabwe,Individuals using the Internet (% of population),Unit (0.0),0.00,0.40,6.40,27.10
13328,Zimbabwe,High-technology exports (% of manufactured exp...,Unit (0),NaN,NaN,2.00,2.00

In [37]:
#Add a column with a unique value
country_data_final['count_indicator_id'] = range(1, len(country_data_final) + 1)
country_data_final

,country_name,indicator,unit,year_1990,year_2000,year_2010,year_2018,count_indicator_id
0,World,"Population, total",Millions (0.00),5280.11,6114.33,6921.87,7592.03,1
1,World,Population growth (annual %),Unit (0.0),1.70,1.30,1.20,1.10,2
19,World,"Primary completion rate, total (% of relevant ...",Unit (0),81.00,82.00,89.00,89.00,3
20,World,"School enrollment, primary (% gross)",Unit (0.0),99.80,98.80,103.20,101.20,4
21,World,"School enrollment, secondary (% gross)",Unit (0),51.00,60.00,71.00,76.00,5
...,...,...,...,...,...,...,...,...
13302,Zimbabwe,"School enrollment, secondary (% gross)",Unit (0),43.00,45.00,NaN,NaN,2102
13303,Zimbabwe,"School enrollment, primary and secondary (gros...",Unit (0),1.00,1.00,NaN,NaN,2103
13326,Zimbabwe,Mobile cellular subscriptions (per 100 people),Unit (0.0),0.00,2.20,60.60,89.40,2104
13327,Zimbabwe,Individuals using the Internet (% of population),Unit (0.0),0.00,0.40,6.40,27.10,2105
13328,Zimbabwe,High-technology exports (% of manufactured exp...,Unit (0),NaN,NaN,2.00,2.00,2106

In [38]:
#Create country_data table in mysql with all data
country_data_final.to_sql('country_data', con = engine, if_exists = 'append', chunksize = 1000)

In [39]:
#Add Primary key in country_data table
query = ("""ALTER TABLE competitive_landscape.country_data ADD PRIMARY KEY(count_indicator_id);""")
cursor.execute(query)